accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/usage/GetPostpaidBundlesBalance-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/ServiceManagement/GetPostpaidBundlesBalance">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetPostpaidBundlesBalanceResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Zero or more repetitions:-->
               <get:Items>
                  <!--Optional:-->
                  <get:UnitOfMeasurement>?</get:UnitOfMeasurement>
                  <!--Optional:-->
                  <get:ActivationDate>?</get:ActivationDate>
                  <!--Optional:-->
                  <get:BalanceDate>?</get:BalanceDate>
                  <!--Optional:-->
                  <get:ExpiryDate>?</get:ExpiryDate>
                  <!--Optional:-->
                  <get:ExpDateCarryOver>?</get:ExpDateCarryOver>
                  <!--Optional:-->
                  <get:FreeUnitApplied>?</get:FreeUnitApplied>
                  <!--Optional:-->
                  <get:FreeUnitCarryOver>?</get:FreeUnitCarryOver>
                  <!--Optional:-->
                  <get:FreeUnitGranted>?</get:FreeUnitGranted>
                  <!--Optional:-->
                  <get:FreeUnitName>?</get:FreeUnitName>
                  <!--Optional:-->
                  <get:FreeUnitElemntSeq>?</get:FreeUnitElemntSeq>
                  <!--Optional:-->
                  <get:FreeUnitPackageVersion>?</get:FreeUnitPackageVersion>
                  <!--Optional:-->
                  <get:LastEventDate>?</get:LastEventDate>
                  <!--Optional:-->
                  <get:AccountingPeriodFrom>?</get:AccountingPeriodFrom>
                  <!--Optional:-->
                  <get:AccountingPeriodTo>?</get:AccountingPeriodTo>
                  <!--Optional:-->
                  <get:Balance>?</get:Balance>
                  <!--Optional:-->
                  <get:ServiceDescription>?</get:ServiceDescription>
                  <!--Optional:-->
                  <get:ApplicationPeriodType>?</get:ApplicationPeriodType>
                  <!--Optional:-->
                  <get:FreeUnitApplyPeriodLength>?</get:FreeUnitApplyPeriodLength>
               </get:Items>
            </lcew:Body>
         </Response>
      </web:GetPostpaidBundlesBalanceResponse>
   </soapenv:Body>
</soapenv:Envelope>